---
kind: method
id: M:Autodesk.Revit.DB.WallSweepInfo.IsEqual(Autodesk.Revit.DB.WallSweepInfo)
source: html/aed19fea-6615-0432-7dfa-176d9132eaee.htm
---
# Autodesk.Revit.DB.WallSweepInfo.IsEqual Method

Determines if the input object is equivalent to this WallSweepInfo.

## Syntax (C#)
```csharp
public bool IsEqual(
	WallSweepInfo toCompare
)
```

## Parameters
- **toCompare** (`Autodesk.Revit.DB.WallSweepInfo`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null